Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70N21.xml
        <register caption="PWM Enable Register" name="PWM_ENA" offset="0x04" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Disable Register" name="PWM_DIS" offset="0x08" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Status Register" name="PWM_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Interrupt Enable Register 1" name="PWM_IER1" offset="0x10" rw="W" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Enable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Enable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Enable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Enable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Enable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Enable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Enable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Enable" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWM Interrupt Disable Register 1" name="PWM_IDR1" offset="0x14" rw="W" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Disable" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Disable" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Disable" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Disable" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Disable" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Disable" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Disable" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Disable" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWM Interrupt Mask Register 1" name="PWM_IMR1" offset="0x18" rw="R" size="4">
          <bitfield caption="Counter Event on Channel 0 Interrupt Mask" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1 Interrupt Mask" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2 Interrupt Mask" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3 Interrupt Mask" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0 Interrupt Mask" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1 Interrupt Mask" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2 Interrupt Mask" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3 Interrupt Mask" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWM Interrupt Status Register 1" name="PWM_ISR1" offset="0x1C" rw="R" size="4">
          <bitfield caption="Counter Event on Channel 0" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Counter Event on Channel 1" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Counter Event on Channel 2" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Counter Event on Channel 3" mask="0x00000008" name="CHID3"/>
          <bitfield caption="Fault Protection Trigger on Channel 0" mask="0x00010000" name="FCHID0"/>
          <bitfield caption="Fault Protection Trigger on Channel 1" mask="0x00020000" name="FCHID1"/>
          <bitfield caption="Fault Protection Trigger on Channel 2" mask="0x00040000" name="FCHID2"/>
          <bitfield caption="Fault Protection Trigger on Channel 3" mask="0x00080000" name="FCHID3"/>
        </register>
        <register caption="PWM Sync Channels Mode Register" name="PWM_SCM" offset="0x20" rw="RW" size="4">
          <bitfield caption="Synchronous Channel 0" mask="0x00000001" name="SYNC0"/>
          <bitfield caption="Synchronous Channel 1" mask="0x00000002" name="SYNC1"/>
          <bitfield caption="Synchronous Channel 2" mask="0x00000004" name="SYNC2"/>
          <bitfield caption="Synchronous Channel 3" mask="0x00000008" name="SYNC3"/>
          <bitfield caption="Synchronous Channels Update Mode" mask="0x00030000" name="UPDM" values="PWM_SCM__UPDM"/>
          <bitfield caption="DMA Transfer Request Mode" mask="0x00100000" name="PTRM"/>
          <bitfield caption="DMA Transfer Request Comparison Selection" mask="0x00E00000" name="PTRCS"/>
        </register>
        <register caption="PWM DMA Register" name="PWM_DMAR" offset="0x24" rw="W" size="4">
          <bitfield caption="Duty-Cycle Holding Register for DMA Access" mask="0x00FFFFFF" name="DMADUTY"/>
        </register>
        <register caption="PWM Sync Channels Update Control Register" name="PWM_SCUC" offset="0x28" rw="RW" size="4">
          <bitfield caption="Synchronous Channels Update Unlock" mask="0x00000001" name="UPDULOCK"/>
        </register>
        <register caption="PWM Sync Channels Update Period Register" name="PWM_SCUP" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Update Period" mask="0x0000000F" name="UPR"/>
          <bitfield caption="Update Period Counter" mask="0x000000F0" name="UPRCNT"/>
        </register>
        <register caption="PWM Sync Channels Update Period Update Register" name="PWM_SCUPUPD" offset="0x30" rw="W" size="4">
          <bitfield caption="Update Period Update" mask="0x0000000F" name="UPRUPD"/>
        </register>
        <register caption="PWM Interrupt Enable Register 2" name="PWM_IER2" offset="0x34" rw="W" size="4">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Enable" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Enable" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Enable" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Enable" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Enable" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Enable" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Enable" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Enable" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Enable" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Enable" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Enable" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Enable" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Enable" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Enable" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Enable" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Enable" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Enable" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Enable" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWM Interrupt Disable Register 2" name="PWM_IDR2" offset="0x38" rw="W" size="4">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Disable" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Disable" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Disable" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Disable" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Disable" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Disable" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Disable" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Disable" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Disable" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Disable" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Disable" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Disable" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Disable" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Disable" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Disable" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Disable" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Disable" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Disable" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWM Interrupt Mask Register 2" name="PWM_IMR2" offset="0x3C" rw="R" size="4">
          <bitfield caption="Write Ready for Synchronous Channels Update Interrupt Mask" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error Interrupt Mask" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match Interrupt Mask" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match Interrupt Mask" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match Interrupt Mask" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match Interrupt Mask" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match Interrupt Mask" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match Interrupt Mask" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match Interrupt Mask" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match Interrupt Mask" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update Interrupt Mask" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update Interrupt Mask" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update Interrupt Mask" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update Interrupt Mask" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update Interrupt Mask" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update Interrupt Mask" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update Interrupt Mask" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update Interrupt Mask" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWM Interrupt Status Register 2" name="PWM_ISR2" offset="0x40" rw="R" size="4">
          <bitfield caption="Write Ready for Synchronous Channels Update" mask="0x00000001" name="WRDY"/>
          <bitfield caption="Synchronous Channels Update Underrun Error" mask="0x00000008" name="UNRE"/>
          <bitfield caption="Comparison 0 Match" mask="0x00000100" name="CMPM0"/>
          <bitfield caption="Comparison 1 Match" mask="0x00000200" name="CMPM1"/>
          <bitfield caption="Comparison 2 Match" mask="0x00000400" name="CMPM2"/>
          <bitfield caption="Comparison 3 Match" mask="0x00000800" name="CMPM3"/>
          <bitfield caption="Comparison 4 Match" mask="0x00001000" name="CMPM4"/>
          <bitfield caption="Comparison 5 Match" mask="0x00002000" name="CMPM5"/>
          <bitfield caption="Comparison 6 Match" mask="0x00004000" name="CMPM6"/>
          <bitfield caption="Comparison 7 Match" mask="0x00008000" name="CMPM7"/>
          <bitfield caption="Comparison 0 Update" mask="0x00010000" name="CMPU0"/>
          <bitfield caption="Comparison 1 Update" mask="0x00020000" name="CMPU1"/>
          <bitfield caption="Comparison 2 Update" mask="0x00040000" name="CMPU2"/>
          <bitfield caption="Comparison 3 Update" mask="0x00080000" name="CMPU3"/>
          <bitfield caption="Comparison 4 Update" mask="0x00100000" name="CMPU4"/>
          <bitfield caption="Comparison 5 Update" mask="0x00200000" name="CMPU5"/>
          <bitfield caption="Comparison 6 Update" mask="0x00400000" name="CMPU6"/>
          <bitfield caption="Comparison 7 Update" mask="0x00800000" name="CMPU7"/>
        </register>
        <register caption="PWM Output Override Value Register" name="PWM_OOV" offset="0x44" rw="RW" size="4">
          <bitfield caption="Output Override Value for PWMH output of the channel 0" mask="0x00000001" name="OOVH0"/>
          <bitfield caption="Output Override Value for PWMH output of the channel 1" mask="0x00000002" name="OOVH1"/>
          <bitfield caption="Output Override Value for PWMH output of the channel 2" mask="0x00000004" name="OOVH2"/>
          <bitfield caption="Output Override Value for PWMH output of the channel 3" mask="0x00000008" name="OOVH3"/>
          <bitfield caption="Output Override Value for PWML output of the channel 0" mask="0x00010000" name="OOVL0"/>
          <bitfield caption="Output Override Value for PWML output of the channel 1" mask="0x00020000" name="OOVL1"/>
          <bitfield caption="Output Override Value for PWML output of the channel 2" mask="0x00040000" name="OOVL2"/>
          <bitfield caption="Output Override Value for PWML output of the channel 3" mask="0x00080000" name="OOVL3"/>
        </register>
        <register caption="PWM Output Selection Register" name="PWM_OS" offset="0x48" rw="RW" size="4">
          <bitfield caption="Output Selection for PWMH output of the channel 0" mask="0x00000001" name="OSH0"/>
          <bitfield caption="Output Selection for PWMH output of the channel 1" mask="0x00000002" name="OSH1"/>
          <bitfield caption="Output Selection for PWMH output of the channel 2" mask="0x00000004" name="OSH2"/>
          <bitfield caption="Output Selection for PWMH output of the channel 3" mask="0x00000008" name="OSH3"/>
          <bitfield caption="Output Selection for PWML output of the channel 0" mask="0x00010000" name="OSL0"/>
          <bitfield caption="Output Selection for PWML output of the channel 1" mask="0x00020000" name="OSL1"/>
          <bitfield caption="Output Selection for PWML output of the channel 2" mask="0x00040000" name="OSL2"/>
          <bitfield caption="Output Selection for PWML output of the channel 3" mask="0x00080000" name="OSL3"/>
        </register>
