Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70N21.xml
        <register caption="Channel Block Control Register (chid = 22)" name="XDMAC_CBC22" offset="0x5F4" rw="RW" size="4">
          <bitfield caption="Channel x Block Length" mask="0x00000FFF" name="BLEN"/>
        </register>
        <register caption="Channel Configuration Register (chid = 22)" name="XDMAC_CC22" offset="0x5F8" rw="RW" size="4">
          <bitfield caption="Channel x Transfer Type" mask="0x00000001" name="TYPE" values="XDMAC_CC22__TYPE"/>
          <bitfield caption="Channel x Memory Burst Size" mask="0x00000006" name="MBSIZE" values="XDMAC_CC22__MBSIZE"/>
          <bitfield caption="Channel x Synchronization" mask="0x00000010" name="DSYNC" values="XDMAC_CC22__DSYNC"/>
          <bitfield caption="Channel x Protection" mask="0x00000020" name="PROT" values="XDMAC_CC22__PROT"/>
          <bitfield caption="Channel x Software Request Trigger" mask="0x00000040" name="SWREQ" values="XDMAC_CC22__SWREQ"/>
          <bitfield caption="Channel x Fill Block of memory" mask="0x00000080" name="MEMSET" values="XDMAC_CC22__MEMSET"/>
          <bitfield caption="Channel x Chunk Size" mask="0x00000700" name="CSIZE" values="XDMAC_CC22__CSIZE"/>
          <bitfield caption="Channel x Data Width" mask="0x00001800" name="DWIDTH" values="XDMAC_CC22__DWIDTH"/>
          <bitfield caption="Channel x Source Interface Identifier" mask="0x00002000" name="SIF" values="XDMAC_CC22__SIF"/>
          <bitfield caption="Channel x Destination Interface Identifier" mask="0x00004000" name="DIF" values="XDMAC_CC22__DIF"/>
          <bitfield caption="Channel x Source Addressing Mode" mask="0x00030000" name="SAM" values="XDMAC_CC22__SAM"/>
          <bitfield caption="Channel x Destination Addressing Mode" mask="0x000C0000" name="DAM" values="XDMAC_CC22__DAM"/>
          <bitfield caption="Channel Initialization Terminated (this bit is read-only)" mask="0x00200000" name="INITD" values="XDMAC_CC22__INITD"/>
          <bitfield caption="Read in Progress (this bit is read-only)" mask="0x00400000" name="RDIP" values="XDMAC_CC22__RDIP"/>
          <bitfield caption="Write in Progress (this bit is read-only)" mask="0x00800000" name="WRIP" values="XDMAC_CC22__WRIP"/>
          <bitfield caption="Channel x Peripheral Identifier" mask="0x7F000000" name="PERID"/>
        </register>
        <register caption="Channel Data Stride Memory Set Pattern (chid = 22)" name="XDMAC_CDS_MSP22" offset="0x5FC" rw="RW" size="4">
          <bitfield caption="Channel x Source Data stride or Memory Set Pattern" mask="0x0000FFFF" name="SDS_MSP"/>
          <bitfield caption="Channel x Destination Data Stride or Memory Set Pattern" mask="0xFFFF0000" name="DDS_MSP"/>
        </register>
        <register caption="Channel Source Microblock Stride (chid = 22)" name="XDMAC_CSUS22" offset="0x600" rw="RW" size="4">
          <bitfield caption="Channel x Source Microblock Stride" mask="0x00FFFFFF" name="SUBS"/>
        </register>
        <register caption="Channel Destination Microblock Stride (chid = 22)" name="XDMAC_CDUS22" offset="0x604" rw="RW" size="4">
          <bitfield caption="Channel x Destination Microblock Stride" mask="0x00FFFFFF" name="DUBS"/>
        </register>
        <register caption="Channel Interrupt Enable Register (chid = 23)" name="XDMAC_CIE23" offset="0x610" rw="W" size="4">
          <bitfield caption="End of Block Interrupt Enable Bit" mask="0x00000001" name="BIE"/>
          <bitfield caption="End of Linked List Interrupt Enable Bit" mask="0x00000002" name="LIE"/>
          <bitfield caption="End of Disable Interrupt Enable Bit" mask="0x00000004" name="DIE"/>
          <bitfield caption="End of Flush Interrupt Enable Bit" mask="0x00000008" name="FIE"/>
          <bitfield caption="Read Bus Error Interrupt Enable Bit" mask="0x00000010" name="RBIE"/>
          <bitfield caption="Write Bus Error Interrupt Enable Bit" mask="0x00000020" name="WBIE"/>
          <bitfield caption="Request Overflow Error Interrupt Enable Bit" mask="0x00000040" name="ROIE"/>
        </register>
        <register caption="Channel Interrupt Disable Register (chid = 23)" name="XDMAC_CID23" offset="0x614" rw="W" size="4">
          <bitfield caption="End of Block Interrupt Disable Bit" mask="0x00000001" name="BID"/>
          <bitfield caption="End of Linked List Interrupt Disable Bit" mask="0x00000002" name="LID"/>
          <bitfield caption="End of Disable Interrupt Disable Bit" mask="0x00000004" name="DID"/>
          <bitfield caption="End of Flush Interrupt Disable Bit" mask="0x00000008" name="FID"/>
          <bitfield caption="Read Bus Error Interrupt Disable Bit" mask="0x00000010" name="RBEID"/>
          <bitfield caption="Write Bus Error Interrupt Disable Bit" mask="0x00000020" name="WBEID"/>
          <bitfield caption="Request Overflow Error Interrupt Disable Bit" mask="0x00000040" name="ROID"/>
        </register>
        <register caption="Channel Interrupt Mask Register (chid = 23)" name="XDMAC_CIM23" offset="0x618" rw="W" size="4">
          <bitfield caption="End of Block Interrupt Mask Bit" mask="0x00000001" name="BIM"/>
          <bitfield caption="End of Linked List Interrupt Mask Bit" mask="0x00000002" name="LIM"/>
          <bitfield caption="End of Disable Interrupt Mask Bit" mask="0x00000004" name="DIM"/>
          <bitfield caption="End of Flush Interrupt Mask Bit" mask="0x00000008" name="FIM"/>
          <bitfield caption="Read Bus Error Interrupt Mask Bit" mask="0x00000010" name="RBEIM"/>
          <bitfield caption="Write Bus Error Interrupt Mask Bit" mask="0x00000020" name="WBEIM"/>
          <bitfield caption="Request Overflow Error Interrupt Mask Bit" mask="0x00000040" name="ROIM"/>
        </register>
        <register caption="Channel Interrupt Status Register (chid = 23)" name="XDMAC_CIS23" offset="0x61C" rw="R" size="4">
          <bitfield caption="End of Block Interrupt Status Bit" mask="0x00000001" name="BIS"/>
          <bitfield caption="End of Linked List Interrupt Status Bit" mask="0x00000002" name="LIS"/>
          <bitfield caption="End of Disable Interrupt Status Bit" mask="0x00000004" name="DIS"/>
          <bitfield caption="End of Flush Interrupt Status Bit" mask="0x00000008" name="FIS"/>
          <bitfield caption="Read Bus Error Interrupt Status Bit" mask="0x00000010" name="RBEIS"/>
          <bitfield caption="Write Bus Error Interrupt Status Bit" mask="0x00000020" name="WBEIS"/>
          <bitfield caption="Request Overflow Error Interrupt Status Bit" mask="0x00000040" name="ROIS"/>
        </register>
        <register caption="Channel Source Address Register (chid = 23)" name="XDMAC_CSA23" offset="0x620" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SA"/>
        </register>
        <register caption="Channel Destination Address Register (chid = 23)" name="XDMAC_CDA23" offset="0x624" rw="RW" size="4">
          <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DA"/>
        </register>
        <register caption="Channel Next Descriptor Address Register (chid = 23)" name="XDMAC_CNDA23" offset="0x628" rw="RW" size="4">
          <bitfield caption="Channel x Next Descriptor Interface" mask="0x00000001" name="NDAIF"/>
          <bitfield caption="Channel x Next Descriptor Address" mask="0xFFFFFFFC" name="NDA"/>
        </register>
        <register caption="Channel Next Descriptor Control Register (chid = 23)" name="XDMAC_CNDC23" offset="0x62C" rw="RW" size="4">
          <bitfield caption="Channel x Next Descriptor Enable" mask="0x00000001" name="NDE" values="XDMAC_CNDC23__NDE"/>
          <bitfield caption="Channel x Next Descriptor Source Update" mask="0x00000002" name="NDSUP" values="XDMAC_CNDC23__NDSUP"/>
          <bitfield caption="Channel x Next Descriptor Destination Update" mask="0x00000004" name="NDDUP" values="XDMAC_CNDC23__NDDUP"/>
          <bitfield caption="Channel x Next Descriptor View" mask="0x00000018" name="NDVIEW" values="XDMAC_CNDC23__NDVIEW"/>
        </register>
        <register caption="Channel Microblock Control Register (chid = 23)" name="XDMAC_CUBC23" offset="0x630" rw="RW" size="4">
          <bitfield caption="Channel x Microblock Length" mask="0x00FFFFFF" name="UBLEN"/>
        </register>
